name: "DeepanoFace"
layer {
	name: "data"
	type: "AnnotatedData"
	top: "data"
	top: "label"
	include {
		phase: TEST
	}
	transform_param {
		scale: 0.007843
		mirror: true
		mean_value: 127.5
		mean_value: 127.5
		mean_value: 127.5
		resize_param {
			prob: 1.0
			resize_mode: WARP
			height: 300
			width: 300
			interp_mode: LINEAR
		}
	}
	data_param {
		source: "../../../../../dataset/facedata/wider_face/lmdb/wider_face_wider_val_lmdb/"
		batch_size: 4
		backend: LMDB
	}
	annotated_data_param {
		batch_sampler {
		}
		label_map_file: "../labelmap_face.prototxt"
	}
}
layer {
	name: "conv0"
	type: "Convolution"
	bottom: "data"
	top: "conv0"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 64
		bias_term: true
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv0/bn"
	type: "BatchNorm"
	bottom: "conv0"
	top: "conv0"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv0/scale"
	type: "Scale"
	bottom: "conv0"
	top: "conv0"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv0/relu"
	type: "ReLU"
	bottom: "conv0"
	top: "conv0"
}
layer {
	name: "conv1"
	type: "Convolution"
	bottom: "conv0"
	top: "conv1"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 64
		bias_term: true
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv1/bn"
	type: "BatchNorm"
	bottom: "conv1"
	top: "conv1"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv1/scale"
	type: "Scale"
	bottom: "conv1"
	top: "conv1"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv1/relu"
	type: "ReLU"
	bottom: "conv1"
	top: "conv1"
}
layer {
	name: "conv2"
	type: "Convolution"
	bottom: "conv1"
	top: "conv2"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 64
		bias_term: true
		kernel_size: 3
        pad: 1
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv2/bn"
	type: "BatchNorm"
	bottom: "conv2"
	top: "conv2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv2/scale"
	type: "Scale"
	bottom: "conv2"
	top: "conv2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv2/relu"
	type: "ReLU"
	bottom: "conv2"
	top: "conv2"
}
layer {
	name: "conv3"
	type: "Convolution"
	bottom: "conv2"
	top: "conv3"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 128
		bias_term: true
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv3/bn"
	type: "BatchNorm"
	bottom: "conv3"
	top: "conv3"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv3/scale"
	type: "Scale"
	bottom: "conv3"
	top: "conv3"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv3/relu"
	type: "ReLU"
	bottom: "conv3"
	top: "conv3"
}
layer {
	name: "conv4"
	type: "Convolution"
	bottom: "conv3"
	top: "conv4"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 128
		bias_term: true
		kernel_size: 3
        pad: 1
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv4/bn"
	type: "BatchNorm"
	bottom: "conv4"
	top: "conv4"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv4/scale"
	type: "Scale"
	bottom: "conv4"
	top: "conv4"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv4/relu"
	type: "ReLU"
	bottom: "conv4"
	top: "conv4"
}
layer {
	name: "conv5"
	type: "Convolution"
	bottom: "conv4"
	top: "conv5"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		bias_term: true
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv5/bn"
	type: "BatchNorm"
	bottom: "conv5"
	top: "conv5"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv5/scale"
	type: "Scale"
	bottom: "conv5"
	top: "conv5"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv5/relu"
	type: "ReLU"
	bottom: "conv5"
	top: "conv5"
}
layer {
	name: "conv6"
	type: "Convolution"
	bottom: "conv5"
	top: "conv6"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 256
		bias_term: true
		kernel_size: 3
        pad: 1
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv6/bn"
	type: "BatchNorm"
	bottom: "conv6"
	top: "conv6"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv6/scale"
	type: "Scale"
	bottom: "conv6"
	top: "conv6"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv6/relu"
	type: "ReLU"
	bottom: "conv6"
	top: "conv6"
}
layer {
	name: "conv7"
	type: "Convolution"
	bottom: "conv6"
	top: "conv7"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 512
		bias_term: true
		kernel_size: 3
        pad: 1
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv7/bn"
	type: "BatchNorm"
	bottom: "conv7"
	top: "conv7"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv7/scale"
	type: "Scale"
	bottom: "conv7"
	top: "conv7"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv7/relu"
	type: "ReLU"
	bottom: "conv7"
	top: "conv7"
}
layer {
	name: "conv8"
	type: "Convolution"
	bottom: "conv7"
	top: "conv8"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 512
		bias_term: true
		kernel_size: 3
        pad: 1
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv8/bn"
	type: "BatchNorm"
	bottom: "conv8"
	top: "conv8"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv8/scale"
	type: "Scale"
	bottom: "conv8"
	top: "conv8"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv8/relu"
	type: "ReLU"
	bottom: "conv8"
	top: "conv8"
}

layer {
	name: "conv9"
	type: "Convolution"
	bottom: "conv8"
	top: "conv9"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		bias_term: true
		kernel_size: 3
        pad: 1
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv9/bn"
	type: "BatchNorm"
	bottom: "conv9"
	top: "conv9"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv9/scale"
	type: "Scale"
	bottom: "conv9"
	top: "conv9"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv9/relu"
	type: "ReLU"
	bottom: "conv9"
	top: "conv9"
}

layer {
	name: "conv10"
	type: "Convolution"
	bottom: "conv9"
	top: "conv10"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		bias_term: true
		kernel_size: 3
        pad: 1
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv10/bn"
	type: "BatchNorm"
	bottom: "conv10"
	top: "conv10"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv10/scale"
	type: "Scale"
	bottom: "conv10"
	top: "conv10"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv10/relu"
	type: "ReLU"
	bottom: "conv10"
	top: "conv10"
}

layer {
	name: "conv11"
	type: "Convolution"
	bottom: "conv10"
	top: "conv11"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		bias_term: true
		kernel_size: 3
        pad: 1
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv11/bn"
	type: "BatchNorm"
	bottom: "conv11"
	top: "conv11"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv11/scale"
	type: "Scale"
	bottom: "conv11"
	top: "conv11"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv11/relu"
	type: "ReLU"
	bottom: "conv11"
	top: "conv11"
}

layer {
	name: "conv12"
	type: "Convolution"
	bottom: "conv11"
	top: "conv12"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		bias_term: true
		kernel_size: 3
        pad: 1
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv12/bn"
	type: "BatchNorm"
	bottom: "conv12"
	top: "conv12"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv12/scale"
	type: "Scale"
	bottom: "conv12"
	top: "conv12"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv12/relu"
	type: "ReLU"
	bottom: "conv12"
	top: "conv12"
}

layer {
	name: "conv13"
	type: "Convolution"
	bottom: "conv12"
	top: "conv13"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		bias_term: true
		kernel_size: 3
        pad: 1
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv13/bn"
	type: "BatchNorm"
	bottom: "conv13"
	top: "conv13"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv13/scale"
	type: "Scale"
	bottom: "conv13"
	top: "conv13"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv13/relu"
	type: "ReLU"
	bottom: "conv13"
	top: "conv13"
}
layer {
	name: "conv14"
	type: "Convolution"
	bottom: "conv13"
	top: "conv14"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		bias_term: true
		kernel_size: 3
        pad: 1
		stride: 2
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv14/bn"
	type: "BatchNorm"
	bottom: "conv14"
	top: "conv14"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv14/scale"
	type: "Scale"
	bottom: "conv14"
	top: "conv14"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv14/relu"
	type: "ReLU"
	bottom: "conv14"
	top: "conv14"
}
layer {
	name: "conv15"
	type: "Convolution"
	bottom: "conv14"
	top: "conv15"
	param {
		lr_mult: 1.0
		decay_mult: 1.0
	}
    param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param {
		num_output: 1024
		bias_term: true
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv15/bn"
	type: "BatchNorm"
	bottom: "conv15"
	top: "conv15"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv15/scale"
	type: "Scale"
	bottom: "conv15"
	top: "conv15"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv15/relu"
	type: "ReLU"
	bottom: "conv15"
	top: "conv15"
}

layer {
	name: "conv7_mbox_loc"
	type: "Convolution"
	bottom: "conv7"
	top: "conv7_mbox_loc"
	param:{
		lr_mult: 1.0
		decay_mult : 1.0
	}
	param:{
		lr_mult: 2.0
		decay_mult: 0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler:
		{
			type: "xavier"
		}
		bias_filler:{
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv7_mbox_loc_perm"
	type: "Permute"
	bottom: "conv7_mbox_loc"
	top: "conv7_mbox_loc_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv7_mbox_loc_flat"
	type: "Flatten"
	bottom: "conv7_mbox_loc_perm"
	top: "conv7_mbox_loc_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv7_mbox_conf"
	type: "Convolution"
	bottom: "conv7"
	top: "conv7_mbox_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 4
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv7_mbox_conf_perm"
	type: "Permute"
	bottom: "conv7_mbox_conf"
	top: "conv7_mbox_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv7_mbox_conf_flat"
	type: "Flatten"
	bottom: "conv7_mbox_conf_perm"
	top: "conv7_mbox_conf_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv7_mbox_blur_conf"
	type: "Convolution"
	bottom: "conv7"
	top: "conv7_mbox_blur_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv7_mbox_blur_conf_perm"
	type: "Permute"
	bottom: "conv7_mbox_blur_conf"
	top: "conv7_mbox_blur_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv7_mbox_blur_conf_flat"
	type: "Flatten"
	bottom: "conv7_mbox_blur_conf_perm"
	top: "conv7_mbox_blur_conf_flat"
	flatten_param {
		axis: 1
	}
}

layer {
	name: "conv7_mbox_occlusion_conf"
	type: "Convolution"
	bottom: "conv7"
	top: "conv7_mbox_occlusion_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv7_mbox_occlusion_conf_perm"
	type: "Permute"
	bottom: "conv7_mbox_occlusion_conf"
	top: "conv7_mbox_occlusion_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv7_mbox_occlusion_conf_flat"
	type: "Flatten"
	bottom: "conv7_mbox_occlusion_conf_perm"
	top: "conv7_mbox_occlusion_conf_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv7_mbox_priorbox"
	type: "PriorBox"
	top: "conv7_mbox_priorbox"
	bottom: "conv7"
	bottom: "data"
	prior_box_param:{
		min_size: 30
		max_size: 45
		flip: true
		clip: false
		variance: 0.1
		variance: 0.1
		variance: 0.2
		variance: 0.2
		offset: 0.5
	}
}

layer {
	name: "conv9_mbox_loc"
	type: "Convolution"
	bottom: "conv9"
	top: "conv9_mbox_loc"
	param:{
		lr_mult: 1.0
		decay_mult : 1.0
	}
	param:{
		lr_mult: 2.0
		decay_mult: 0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler:
		{
			type: "xavier"
		}
		bias_filler:{
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv9_mbox_loc_perm"
	type: "Permute"
	bottom: "conv9_mbox_loc"
	top: "conv9_mbox_loc_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv9_mbox_loc_flat"
	type: "Flatten"
	bottom: "conv9_mbox_loc_perm"
	top: "conv9_mbox_loc_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv9_mbox_conf"
	type: "Convolution"
	bottom: "conv9"
	top: "conv9_mbox_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 4
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv9_mbox_conf_perm"
	type: "Permute"
	bottom: "conv9_mbox_conf"
	top: "conv9_mbox_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv9_mbox_conf_flat"
	type: "Flatten"
	bottom: "conv9_mbox_conf_perm"
	top: "conv9_mbox_conf_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv9_mbox_blur_conf"
	type: "Convolution"
	bottom: "conv9"
	top: "conv9_mbox_blur_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv9_mbox_blur_conf_perm"
	type: "Permute"
	bottom: "conv9_mbox_blur_conf"
	top: "conv9_mbox_blur_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv9_mbox_blur_conf_flat"
	type: "Flatten"
	bottom: "conv9_mbox_blur_conf_perm"
	top: "conv9_mbox_blur_conf_flat"
	flatten_param {
		axis: 1
	}
}

layer {
	name: "conv9_mbox_occlusion_conf"
	type: "Convolution"
	bottom: "conv9"
	top: "conv9_mbox_occlusion_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv9_mbox_occlusion_conf_perm"
	type: "Permute"
	bottom: "conv9_mbox_occlusion_conf"
	top: "conv9_mbox_occlusion_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv9_mbox_occlusion_conf_flat"
	type: "Flatten"
	bottom: "conv9_mbox_occlusion_conf_perm"
	top: "conv9_mbox_occlusion_conf_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv9_mbox_priorbox"
	type: "PriorBox"
	top: "conv9_mbox_priorbox"
	bottom: "conv9"
	bottom: "data"
	prior_box_param:{
		min_size: 90
		max_size: 150
		flip: true
		clip: false
		variance: 0.1
		variance: 0.1
		variance: 0.2
		variance: 0.2
		offset: 0.5
	}
}
layer {
	name: "conv11_mbox_loc"
	type: "Convolution"
	bottom: "conv11"
	top: "conv11_mbox_loc"
	param:{
		lr_mult: 1.0
		decay_mult : 1.0
	}
	param:{
		lr_mult: 2.0
		decay_mult: 0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler:
		{
			type: "xavier"
		}
		bias_filler:{
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv11_mbox_loc_perm"
	type: "Permute"
	bottom: "conv11_mbox_loc"
	top: "conv11_mbox_loc_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv11_mbox_loc_flat"
	type: "Flatten"
	bottom: "conv11_mbox_loc_perm"
	top: "conv11_mbox_loc_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv11_mbox_conf"
	type: "Convolution"
	bottom: "conv11"
	top: "conv11_mbox_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 4
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv11_mbox_conf_perm"
	type: "Permute"
	bottom: "conv11_mbox_conf"
	top: "conv11_mbox_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv11_mbox_conf_flat"
	type: "Flatten"
	bottom: "conv11_mbox_conf_perm"
	top: "conv11_mbox_conf_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv11_mbox_blur_conf"
	type: "Convolution"
	bottom: "conv11"
	top: "conv11_mbox_blur_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv11_mbox_blur_conf_perm"
	type: "Permute"
	bottom: "conv11_mbox_blur_conf"
	top: "conv11_mbox_blur_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv11_mbox_blur_conf_flat"
	type: "Flatten"
	bottom: "conv11_mbox_blur_conf_perm"
	top: "conv11_mbox_blur_conf_flat"
	flatten_param {
		axis: 1
	}
}

layer {
	name: "conv11_mbox_occlusion_conf"
	type: "Convolution"
	bottom: "conv11"
	top: "conv11_mbox_occlusion_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv11_mbox_occlusion_conf_perm"
	type: "Permute"
	bottom: "conv11_mbox_occlusion_conf"
	top: "conv11_mbox_occlusion_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv11_mbox_occlusion_conf_flat"
	type: "Flatten"
	bottom: "conv11_mbox_occlusion_conf_perm"
	top: "conv11_mbox_occlusion_conf_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv11_mbox_priorbox"
	type: "PriorBox"
	top: "conv11_mbox_priorbox"
	bottom: "conv11"
	bottom: "data"
	prior_box_param:{
		min_size: 120
		max_size: 200
		flip: true
		clip: false
		variance: 0.1
		variance: 0.1
		variance: 0.2
		variance: 0.2
		offset: 0.5
	}
}
layer {
	name: "conv13_mbox_loc"
	type: "Convolution"
	bottom: "conv13"
	top: "conv13_mbox_loc"
	param:{
		lr_mult: 1.0
		decay_mult : 1.0
	}
	param:{
		lr_mult: 2.0
		decay_mult: 0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler:
		{
			type: "xavier"
		}
		bias_filler:{
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv13_mbox_loc_perm"
	type: "Permute"
	bottom: "conv13_mbox_loc"
	top: "conv13_mbox_loc_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv13_mbox_loc_flat"
	type: "Flatten"
	bottom: "conv13_mbox_loc_perm"
	top: "conv13_mbox_loc_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv13_mbox_conf"
	type: "Convolution"
	bottom: "conv13"
	top: "conv13_mbox_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 4
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv13_mbox_conf_perm"
	type: "Permute"
	bottom: "conv13_mbox_conf"
	top: "conv13_mbox_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv13_mbox_conf_flat"
	type: "Flatten"
	bottom: "conv13_mbox_conf_perm"
	top: "conv13_mbox_conf_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv13_mbox_blur_conf"
	type: "Convolution"
	bottom: "conv13"
	top: "conv13_mbox_blur_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv13_mbox_blur_conf_perm"
	type: "Permute"
	bottom: "conv13_mbox_blur_conf"
	top: "conv13_mbox_blur_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv13_mbox_blur_conf_flat"
	type: "Flatten"
	bottom: "conv13_mbox_blur_conf_perm"
	top: "conv13_mbox_blur_conf_flat"
	flatten_param {
		axis: 1
	}
}

layer {
	name: "conv13_mbox_occlusion_conf"
	type: "Convolution"
	bottom: "conv13"
	top: "conv13_mbox_occlusion_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv13_mbox_occlusion_conf_perm"
	type: "Permute"
	bottom: "conv13_mbox_occlusion_conf"
	top: "conv13_mbox_occlusion_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv13_mbox_occlusion_conf_flat"
	type: "Flatten"
	bottom: "conv13_mbox_occlusion_conf_perm"
	top: "conv13_mbox_occlusion_conf_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv13_mbox_priorbox"
	type: "PriorBox"
	top: "conv13_mbox_priorbox"
	bottom: "conv13"
	bottom: "data"
	prior_box_param:{
		min_size: 150
		max_size: 250
		flip: true
		clip: false
		variance: 0.1
		variance: 0.1
		variance: 0.2
		variance: 0.2
		offset: 0.5
	}
}
layer {
	name: "conv15_mbox_loc"
	type: "Convolution"
	bottom: "conv15"
	top: "conv15_mbox_loc"
	param:{
		lr_mult: 1.0
		decay_mult : 1.0
	}
	param:{
		lr_mult: 2.0
		decay_mult: 0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler:
		{
			type: "xavier"
		}
		bias_filler:{
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv15_mbox_loc_perm"
	type: "Permute"
	bottom: "conv15_mbox_loc"
	top: "conv15_mbox_loc_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv15_mbox_loc_flat"
	type: "Flatten"
	bottom: "conv15_mbox_loc_perm"
	top: "conv15_mbox_loc_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv15_mbox_conf"
	type: "Convolution"
	bottom: "conv15"
	top: "conv15_mbox_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 4
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv15_mbox_conf_perm"
	type: "Permute"
	bottom: "conv15_mbox_conf"
	top: "conv15_mbox_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv15_mbox_conf_flat"
	type: "Flatten"
	bottom: "conv15_mbox_conf_perm"
	top: "conv15_mbox_conf_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv15_mbox_blur_conf"
	type: "Convolution"
	bottom: "conv15"
	top: "conv15_mbox_blur_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv15_mbox_blur_conf_perm"
	type: "Permute"
	bottom: "conv15_mbox_blur_conf"
	top: "conv15_mbox_blur_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv15_mbox_blur_conf_flat"
	type: "Flatten"
	bottom: "conv15_mbox_blur_conf_perm"
	top: "conv15_mbox_blur_conf_flat"
	flatten_param {
		axis: 1
	}
}

layer {
	name: "conv15_mbox_occlusion_conf"
	type: "Convolution"
	bottom: "conv15"
	top: "conv15_mbox_occlusion_conf"
	param: {
		lr_mult: 1.0
		decay_mult: 1.0
	}
	param: {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	convolution_param:{
		num_output: 8
		kernel_size: 1
		weight_filler: {
			type: "xavier"
		}
		bias_filler: {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv15_mbox_occlusion_conf_perm"
	type: "Permute"
	bottom: "conv15_mbox_occlusion_conf"
	top: "conv15_mbox_occlusion_conf_perm"
	permute_param {
		order: 0
		order: 2
		order: 3
		order: 1
	}
}
layer {
	name: "conv15_mbox_occlusion_conf_flat"
	type: "Flatten"
	bottom: "conv15_mbox_occlusion_conf_perm"
	top: "conv15_mbox_occlusion_conf_flat"
	flatten_param {
		axis: 1
	}
}
layer {
	name: "conv15_mbox_priorbox"
	type: "PriorBox"
	top: "conv15_mbox_priorbox"
	bottom: "conv15"
	bottom: "data"
	prior_box_param:{
		min_size: 180
		max_size: 300
		flip: true
		clip: false
		variance: 0.1
		variance: 0.1
		variance: 0.2
		variance: 0.2
		offset: 0.5
	}
}
layer {
	name: "mbox_loc"
	type: "Concat"
	bottom: "conv7_mbox_loc_flat"
	bottom: "conv9_mbox_loc_flat"
	bottom: "conv11_mbox_loc_flat"
	bottom: "conv13_mbox_loc_flat"
	bottom: "conv15_mbox_loc_flat"
	top: "mbox_loc"
	concat_param {
		axis: 1
	}
}
layer {
	name: "mbox_conf"
	type: "Concat"
	bottom: "conv7_mbox_conf_flat"
	bottom: "conv9_mbox_conf_flat"
	bottom: "conv11_mbox_conf_flat"
	bottom: "conv13_mbox_conf_flat"
	bottom: "conv15_mbox_conf_flat"
	top: "mbox_conf"
	concat_param {
		axis: 1
	}
}
layer {
	name: "mbox_blur_conf"
	type: "Concat"
	bottom: "conv7_mbox_blur_conf_flat"
	bottom: "conv9_mbox_blur_conf_flat"
	bottom: "conv11_mbox_blur_conf_flat"
	bottom: "conv13_mbox_blur_conf_flat"
	bottom: "conv15_mbox_blur_conf_flat"
	top: "mbox_blur_conf"
	concat_param {
		axis: 1
	}
}
layer {
	name: "mbox_occlusion_conf"
	type: "Concat"
	bottom: "conv7_mbox_occlusion_conf_flat"
	bottom: "conv9_mbox_occlusion_conf_flat"
	bottom: "conv11_mbox_occlusion_conf_flat"
	bottom: "conv13_mbox_occlusion_conf_flat"
	bottom: "conv15_mbox_occlusion_conf_flat"
	top: "mbox_occlusion_conf"
	concat_param {
		axis: 1
	}
}
layer {
	name: "mbox_priorbox"
	type: "Concat"
	bottom: "conv7_mbox_priorbox"
	bottom: "conv9_mbox_priorbox"
	bottom: "conv11_mbox_priorbox"
	bottom: "conv13_mbox_priorbox"
	bottom: "conv15_mbox_priorbox"
	top: "mbox_priorbox"
	concat_param {
		axis: 2
	}
}
layer {
  name: "detection_out"
  type: "DetectionOutput"
  bottom: "mbox_loc"
  bottom: "mbox_conf"
  bottom: "mbox_priorbox"
  bottom: "mbox_blur_conf"
  bottom: "mbox_occlusion_conf"
  top: "detection_out"
  include {
    phase: TEST
  }
  detection_output_param {
    num_classes: 2
	num_blur: 4
	num_occlusion: 4
    share_location: true
    background_label_id: 0
    background_blur_id: -1
	background_occl_id: -1
	visualize: true
    nms_param {
      nms_threshold: 0.55
      top_k: 100
    }
    code_type: CENTER_SIZE
    keep_top_k: 50
    confidence_threshold: 0.01
  }
}
layer {
  name: "detection_eval"
  type: "DetectionEvaluate"
  bottom: "detection_out"
  bottom: "label"
  top: "detection_eval"
  include {
    phase: TEST
  }
  detection_evaluate_param {
    num_classes: 2
    background_label_id: 0
    overlap_threshold: 0.5
    evaluate_difficult_gt: false
  }
}

