name: "DeepanoFace"
input: "data"
input_shape {
	dim: 1
	dim: 3
	dim: 640
	dim: 640
}
layer {
	name: "conv1_1"
	type: "Convolution"
	bottom: "data"
	top: "conv1_1"
	convolution_param {
	num_output: 64
		pad: 1
		kernel_size: 3
	}
}
layer {
	name: "conv1_1/bn"
	type: "BatchNorm"
	bottom: "conv1_1"
	top: "conv1_1"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv1_1/scale"
	type: "Scale"
	bottom: "conv1_1"
	top: "conv1_1"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "relu1_1"
	type: "ReLU"
	bottom: "conv1_1"
	top: "conv1_1"
}
layer {
	name: "conv1_2"
	type: "Convolution"
	bottom: "conv1_1"
	top: "conv1_2"
	convolution_param {
	num_output: 64
		pad: 1
		kernel_size: 3
	}
}
layer {
	name: "conv1_2/bn"
	type: "BatchNorm"
	bottom: "conv1_2"
	top: "conv1_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv1_2/scale"
	type: "Scale"
	bottom: "conv1_2"
	top: "conv1_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "relu1_2"
	type: "ReLU"
	bottom: "conv1_2"
	top: "conv1_2"
}
layer {
	name: "pool1"
	type: "Pooling"
	bottom: "conv1_2"
	top: "pool1"
	pooling_param {
	pool: MAX
	kernel_size: 2
	stride: 2
	}
}
layer {
	name: "conv2_1"
	type: "Convolution"
	bottom: "pool1"
	top: "conv2_1"
	convolution_param {
	num_output: 128
		pad: 1
		kernel_size: 3
	}
}
layer {
	name: "conv2_1/bn"
	type: "BatchNorm"
	bottom: "conv2_1"
	top: "conv2_1"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv2_1/scale"
	type: "Scale"
	bottom: "conv2_1"
	top: "conv2_1"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "relu2_1"
	type: "ReLU"
	bottom: "conv2_1"
	top: "conv2_1"
}
layer {
	name: "conv2_2"
	type: "Convolution"
	bottom: "conv2_1"
	top: "conv2_2"
	convolution_param {
	num_output: 128
		pad: 1
		kernel_size: 3
	}
}
layer {
	name: "conv2_2/bn"
	type: "BatchNorm"
	bottom: "conv2_2"
	top: "conv2_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv2_2/scale"
	type: "Scale"
	bottom: "conv2_2"
	top: "conv2_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "relu2_2"
	type: "ReLU"
	bottom: "conv2_2"
	top: "conv2_2"
}

layer {
	name: "pool2"
	type: "Pooling"
	bottom: "conv2_2"
	top: "pool2"
	pooling_param {
	pool: MAX
	kernel_size: 2
	stride: 2
	}
}
layer {
	name: "conv3_1"
	type: "Convolution"
	bottom: "pool2"
	top: "conv3_1"
	convolution_param {
	num_output: 256
	pad: 1
	kernel_size: 3
	}
}
layer {
	name: "conv3_1/bn"
	type: "BatchNorm"
	bottom: "conv3_1"
	top: "conv3_1"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv3_1/scale"
	type: "Scale"
	bottom: "conv3_1"
	top: "conv3_1"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "relu3_1"
	type: "ReLU"
	bottom: "conv3_1"
	top: "conv3_1"
}
layer {
	name: "conv3_2"
	type: "Convolution"
	bottom: "conv3_1"
	top: "conv3_2"
	convolution_param {
	num_output: 256
	pad: 1
	kernel_size: 3
	}
}
layer {
	name: "conv3_2/bn"
	type: "BatchNorm"
	bottom: "conv3_2"
	top: "conv3_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv3_2/scale"
	type: "Scale"
	bottom: "conv3_2"
	top: "conv3_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "relu3_2"
	type: "ReLU"
	bottom: "conv3_2"
	top: "conv3_2"
}
layer {
	name: "conv3_3"
	type: "Convolution"
	bottom: "conv3_2"
	top: "conv3_3"
	convolution_param {
	num_output: 256
		pad: 1
		kernel_size: 3
	}
}
layer {
	name: "conv3_3/bn"
	type: "BatchNorm"
	bottom: "conv3_3"
	top: "conv3_3"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv3_3/scale"
	type: "Scale"
	bottom: "conv3_3"
	top: "conv3_3"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "relu3_3"
	type: "ReLU"
	bottom: "conv3_3"
	top: "conv3_3"
}
layer {
	name: "pool3"
	type: "Pooling"
	bottom: "conv3_3"
	top: "pool3"
	pooling_param {
	pool: MAX
	kernel_size: 2
	stride: 2
	}
}
layer {
	name: "conv4_1"
	type: "Convolution"
	bottom: "pool3"
	top: "conv4_1"
	convolution_param {
	num_output: 512
		pad: 1
		kernel_size: 3
	}
}
layer {
	name: "conv4_1/bn"
	type: "BatchNorm"
	bottom: "conv4_1"
	top: "conv4_1"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv4_1/scale"
	type: "Scale"
	bottom: "conv4_1"
	top: "conv4_1"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "relu4_1"
	type: "ReLU"
	bottom: "conv4_1"
	top: "conv4_1"
}
layer {
	name: "conv4_2"
	type: "Convolution"
	bottom: "conv4_1"
	top: "conv4_2"
	convolution_param {
	num_output: 512
		pad: 1
		kernel_size: 3
	}
}
layer {
	name: "conv4_2/bn"
	type: "BatchNorm"
	bottom: "conv4_2"
	top: "conv4_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv4_2/scale"
	type: "Scale"
	bottom: "conv4_2"
	top: "conv4_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "relu4_2"
	type: "ReLU"
	bottom: "conv4_2"
	top: "conv4_2"
}
layer {
	name: "conv4_3"
	type: "Convolution"
	bottom: "conv4_2"
	top: "conv4_3"
	convolution_param {
	num_output: 512
	pad: 1
	kernel_size: 3
	}
}
layer {
	name: "conv4_3/bn"
	type: "BatchNorm"
	bottom: "conv4_3"
	top: "conv4_3"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv4_3/scale"
	type: "Scale"
	bottom: "conv4_3"
	top: "conv4_3"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "relu4_3"
	type: "ReLU"
	bottom: "conv4_3"
	top: "conv4_3"
}
layer {
	name: "pool4"
	type: "Pooling"
	bottom: "conv4_3"
	top: "pool4"
	pooling_param {
	pool: MAX
		kernel_size: 2
		stride: 2
	}
}
layer {
	name: "conv5_1"
	type: "Convolution"
	bottom: "pool4"
	top: "conv5_1"
	convolution_param {
	num_output: 512
		pad: 1
		kernel_size: 3
	}
}
layer {
	name: "conv5_1/bn"
	type: "BatchNorm"
	bottom: "conv5_1"
	top: "conv5_1"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv5_1/scale"
	type: "Scale"
	bottom: "conv5_1"
	top: "conv5_1"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "relu5_1"
	type: "ReLU"
	bottom: "conv5_1"
	top: "conv5_1"
}
layer {
	name: "conv5_2"
	type: "Convolution"
	bottom: "conv5_1"
	top: "conv5_2"
	convolution_param {
	num_output: 512
	pad: 1
	kernel_size: 3
	}
}
layer {
	name: "conv5_2/bn"
	type: "BatchNorm"
	bottom: "conv5_2"
	top: "conv5_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv5_2/scale"
	type: "Scale"
	bottom: "conv5_2"
	top: "conv5_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "relu5_2"
	type: "ReLU"
	bottom: "conv5_2"
	top: "conv5_2"
}
layer {
	name: "conv5_3"
	type: "Convolution"
	bottom: "conv5_2"
	top: "conv5_3"
	convolution_param {
	num_output: 512
		pad: 1
		kernel_size: 3
	}
}
layer {
	name: "conv5_3/bn"
	type: "BatchNorm"
	bottom: "conv5_3"
	top: "conv5_3"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv5_3/scale"
	type: "Scale"
	bottom: "conv5_3"
	top: "conv5_3"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "relu5_3"
	type: "ReLU"
	bottom: "conv5_3"
	top: "conv5_3"
}
layer {
	name: "conv6_1"
	type: "Convolution"
	bottom: "conv5_3"
	top: "conv6_1"
	convolution_param {
	num_output: 256
		pad: 1
		kernel_size: 3
		stride: 2
	}
}
layer {
	name: "conv6_1/bn"
	type: "BatchNorm"
	bottom: "conv6_1"
	top: "conv6_1"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv6_1/scale"
	type: "Scale"
	bottom: "conv6_1"
	top: "conv6_1"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv6_1/relu"
	type: "ReLU"
	bottom: "conv6_1"
	top: "conv6_1"
}
layer {
	name: "conv6_2"
	type: "Convolution"
	bottom: "conv6_1"
	top: "conv6_2"
	convolution_param {
	num_output: 256
		pad: 1
		kernel_size: 3
	}
}
layer {
	name: "conv6_2/bn"
	type: "BatchNorm"
	bottom: "conv6_2"
	top: "conv6_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv6_2/scale"
	type: "Scale"
	bottom: "conv6_2"
	top: "conv6_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv6_2/relu"
	type: "ReLU"
	bottom: "conv6_2"
	top: "conv6_2"
}
layer {
	name: "conv7_1"
	type: "Convolution"
	bottom: "conv6_2"
	top: "conv7_1"
	convolution_param {
	num_output: 128
		pad: 1
		kernel_size: 3
		stride: 2
	}
}
layer {
	name: "conv7_1/bn"
	type: "BatchNorm"
	bottom: "conv7_1"
	top: "conv7_1"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv7_1/scale"
	type: "Scale"
	bottom: "conv7_1"
	top: "conv7_1"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv7_1/relu"
	type: "ReLU"
	bottom: "conv7_1"
	top: "conv7_1"
}
layer {
	name: "conv7_2"
	type: "Convolution"
	bottom: "conv7_1"
	top: "conv7_2"
	convolution_param {
	num_output: 128
		pad: 1
		kernel_size: 3
	}
}
layer {
	name: "conv7_2/bn"
	type: "BatchNorm"
	bottom: "conv7_2"
	top: "conv7_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv7_2/scale"
	type: "Scale"
	bottom: "conv7_2"
	top: "conv7_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv7_2/relu"
	type: "ReLU"
	bottom: "conv7_2"
	top: "conv7_2"
}
layer {
	name: "conv8_1"
	type: "Convolution"
	bottom: "conv7_2"
	top: "conv8_1"
	convolution_param {
	num_output: 256
		pad: 1
		kernel_size: 3
		stride: 2
	}
}
layer {
	name: "conv8_1/bn"
	type: "BatchNorm"
	bottom: "conv8_1"
	top: "conv8_1"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv8_1/scale"
	type: "Scale"
	bottom: "conv8_1"
	top: "conv8_1"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv8_1/relu"
	type: "ReLU"
	bottom: "conv8_1"
	top: "conv8_1"
}
layer {
	name: "conv8_2"
	type: "Convolution"
	bottom: "conv8_1"
	top: "conv8_2"
	convolution_param {
	num_output: 256
		pad: 1
		kernel_size: 3
	}
}
layer {
	name: "conv8_2/bn"
	type: "BatchNorm"
	bottom: "conv8_2"
	top: "conv8_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv8_2/scale"
	type: "Scale"
	bottom: "conv8_2"
	top: "conv8_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv8_2/relu"
	type: "ReLU"
	bottom: "conv8_2"
	top: "conv8_2"
}
#######################################################################
#                             modeule one                             #
#######################################################################
##########################LFPN MOUDLE#######################
layer{
	name: "conv4_3_lfpn"
	type: "Convolution"
	bottom: "conv4_3"
	top: "conv4_3_lfpn"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 512
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv4_3_lfpn/bn"
	type: "BatchNorm"
	bottom: "conv4_3_lfpn"
	top: "conv4_3_lfpn"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv4_3_lfpn/scale"
	type: "Scale"
	bottom: "conv4_3_lfpn"
	top: "conv4_3_lfpn"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv4_3_lfpn/relu"
	type: "ReLU"
	bottom: "conv4_3_lfpn"
	top: "conv4_3_lfpn"
}

layer{
	name: "conv4_3_lfpn/dec"
	type: "DeConvolution"
	bottom: "conv4_3_lfpn"
	top: "conv4_3_lfpn/dec"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 512
		kernel_size: 4
		stride: 2
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv4_3_lfpn/dec/bn"
	type: "BatchNorm"
	bottom: "conv4_3_lfpn/dec"
	top: "conv4_3_lfpn/dec"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv4_3_lfpn/dec/scale"
	type: "Scale"
	bottom: "conv4_3_lfpn/dec"
	top: "conv4_3_lfpn/dec"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv4_3_lfpn/dec/relu"
	type: "ReLU"
	bottom: "conv4_3_lfpn/dec"
	top: "conv4_3_lfpn/dec"
}
layer{
	name: "conv3_3_lfpn"
	type: "Convolution"
	bottom: "conv3_3"
	top: "conv3_3_lfpn"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 512
		kernel_size: 1
		stride: 1
		pad: 0
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv3_3_lfpn/bn"
	type: "BatchNorm"
	bottom: "conv3_3_lfpn"
	top: "conv3_3_lfpn"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv3_3_lfpn/scale"
	type: "Scale"
	bottom: "conv3_3_lfpn"
	top: "conv3_3_lfpn"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv3_3_lfpn/relu"
	type: "ReLU"
	bottom: "conv3_3_lfpn"
	top: "conv3_3_lfpn"
}
layer{
	name: "lfpn_1/eltwise"
	type: "Eltwise"
	bottom: "conv4_3_lfpn/dec"
	bottom: "conv3_3_lfpn"
	top: "lfpn_1_moudle"
	eltwise_param {
		operation: SUM
	}
}
#################context moudle####################
layer{
	name: "lfpn_1_moudle_cpm_3_3"
	type: "Convolution"
	bottom: "lfpn_1_moudle"
	top: "lfpn_1_moudle_cpm_3_3"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 512
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "lfpn_1_moudle_cpm_3_3/bn"
	type: "BatchNorm"
	bottom: "lfpn_1_moudle_cpm_3_3"
	top: "lfpn_1_moudle_cpm_3_3"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "lfpn_1_moudle_cpm_3_3/scale"
	type: "Scale"
	bottom: "lfpn_1_moudle_cpm_3_3"
	top: "lfpn_1_moudle_cpm_3_3"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "lfpn_1_moudle_cpm_3_3/relu"
	type: "ReLU"
	bottom: "lfpn_1_moudle_cpm_3_3"
	top: "lfpn_1_moudle_cpm_3_3"
}
layer{
	name: "lfpn_1_moudle_cpm_3_3_one_channel"
	type: "Convolution"
	bottom: "lfpn_1_moudle_cpm_3_3"
	top: "lfpn_1_moudle_cpm_3_3_one_channel"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "lfpn_1_moudle_cpm_3_3_one_channel/bn"
	type: "BatchNorm"
	bottom: "lfpn_1_moudle_cpm_3_3_one_channel"
	top: "lfpn_1_moudle_cpm_3_3_one_channel"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "lfpn_1_moudle_cpm_3_3_one_channel/scale"
	type: "Scale"
	bottom: "lfpn_1_moudle_cpm_3_3_one_channel"
	top: "lfpn_1_moudle_cpm_3_3_one_channel"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "lfpn_1_moudle_cpm_3_3_one_channel/relu"
	type: "ReLU"
	bottom: "lfpn_1_moudle_cpm_3_3_one_channel"
	top: "lfpn_1_moudle_cpm_3_3_one_channel"
}
#####
layer{
	name: "lfpn_1_moudle_cpm_3_3_two_channel"
	type: "Convolution"
	bottom: "lfpn_1_moudle_cpm_3_3"
	top: "lfpn_1_moudle_cpm_3_3_two_channel"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "lfpn_1_moudle_cpm_3_3_two_channel/bn"
	type: "BatchNorm"
	bottom: "lfpn_1_moudle_cpm_3_3_two_channel"
	top: "lfpn_1_moudle_cpm_3_3_two_channel"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "lfpn_1_moudle_cpm_3_3_two_channel/scale"
	type: "Scale"
	bottom: "lfpn_1_moudle_cpm_3_3_two_channel"
	top: "lfpn_1_moudle_cpm_3_3_two_channel"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "lfpn_1_moudle_cpm_3_3_two_channel/relu"
	type: "ReLU"
	bottom: "lfpn_1_moudle_cpm_3_3_two_channel"
	top: "lfpn_1_moudle_cpm_3_3_two_channel"
}

layer{
	name: "lfpn_1_moudle_cpm_3_3_two_channel_2"
	type: "Convolution"
	bottom: "lfpn_1_moudle_cpm_3_3_two_channel"
	top: "lfpn_1_moudle_cpm_3_3_two_channel_2"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "lfpn_1_moudle_cpm_3_3_two_channel_2/bn"
	type: "BatchNorm"
	bottom: "lfpn_1_moudle_cpm_3_3_two_channel_2"
	top: "lfpn_1_moudle_cpm_3_3_two_channel_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "lfpn_1_moudle_cpm_3_3_two_channel_2/scale"
	type: "Scale"
	bottom: "lfpn_1_moudle_cpm_3_3_two_channel_2"
	top: "lfpn_1_moudle_cpm_3_3_two_channel_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "lfpn_1_moudle_cpm_3_3_two_channel_2/relu"
	type: "ReLU"
	bottom: "lfpn_1_moudle_cpm_3_3_two_channel_2"
	top: "lfpn_1_moudle_cpm_3_3_two_channel_2"
}
layer {
	name: "dectction_moudle_one"
	type: "Concat"
	bottom: "lfpn_1_moudle_cpm_3_3_one_channel"
	bottom: "lfpn_1_moudle_cpm_3_3_two_channel_2"
	top: "dectction_moudle_one"
}
#######################################################################
#                             modeule two                             #
#######################################################################
##########################LFPN MOUDLE##################################
layer{
	name: "conv5_3_lfpn"
	type: "Convolution"
	bottom: "conv5_3"
	top: "conv5_3_lfpn"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 512
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv5_3_lfpn/bn"
	type: "BatchNorm"
	bottom: "conv5_3_lfpn"
	top: "conv5_3_lfpn"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv5_3_lfpn/scale"
	type: "Scale"
	bottom: "conv5_3_lfpn"
	top: "conv5_3_lfpn"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv5_3_lfpn/relu"
	type: "ReLU"
	bottom: "conv5_3_lfpn"
	top: "conv5_3_lfpn"
}

layer{
	name: "conv5_3_lfpn/dec"
	type: "DeConvolution"
	bottom: "conv5_3_lfpn"
	top: "conv5_3_lfpn/dec"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 512
		kernel_size: 4
		stride: 2
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv5_3_lfpn/dec/bn"
	type: "BatchNorm"
	bottom: "conv5_3_lfpn/dec"
	top: "conv5_3_lfpn/dec"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv5_3_lfpn/dec/scale"
	type: "Scale"
	bottom: "conv5_3_lfpn/dec"
	top: "conv5_3_lfpn/dec"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv5_3_lfpn/dec/relu"
	type: "ReLU"
	bottom: "conv5_3_lfpn/dec"
	top: "conv5_3_lfpn/dec"
}

layer{
	name: "lfpn_2/eltwise"
	type: "Eltwise"
	bottom: "conv5_3_lfpn/dec"
	bottom: "conv4_3_lfpn"
	top: "lfpn_2_moudle"
	eltwise_param {
		operation: SUM
	}
}
#################context moudle####################
layer{
	name: "lfpn_2_moudle_cpm_4_3"
	type: "Convolution"
	bottom: "lfpn_2_moudle"
	top: "lfpn_2_moudle_cpm_4_3"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 512
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "lfpn_2_moudle_cpm_4_3/bn"
	type: "BatchNorm"
	bottom: "lfpn_2_moudle_cpm_4_3"
	top: "lfpn_2_moudle_cpm_4_3"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "lfpn_2_moudle_cpm_4_3/scale"
	type: "Scale"
	bottom: "lfpn_2_moudle_cpm_4_3"
	top: "lfpn_2_moudle_cpm_4_3"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "lfpn_2_moudle_cpm_4_3/relu"
	type: "ReLU"
	bottom: "lfpn_2_moudle_cpm_4_3"
	top: "lfpn_2_moudle_cpm_4_3"
}
layer{
	name: "lfpn_2_moudle_cpm_4_3_one_channel"
	type: "Convolution"
	bottom: "lfpn_2_moudle_cpm_4_3"
	top: "lfpn_2_moudle_cpm_4_3_one_channel"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "lfpn_2_moudle_cpm_4_3_one_channel/bn"
	type: "BatchNorm"
	bottom: "lfpn_2_moudle_cpm_4_3_one_channel"
	top: "lfpn_2_moudle_cpm_4_3_one_channel"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "lfpn_2_moudle_cpm_4_3_one_channel/scale"
	type: "Scale"
	bottom: "lfpn_2_moudle_cpm_4_3_one_channel"
	top: "lfpn_2_moudle_cpm_4_3_one_channel"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "lfpn_2_moudle_cpm_4_3_one_channel/relu"
	type: "ReLU"
	bottom: "lfpn_2_moudle_cpm_4_3_one_channel"
	top: "lfpn_2_moudle_cpm_4_3_one_channel"
}
#####
layer{
	name: "lfpn_2_moudle_cpm_4_3_two_channel"
	type: "Convolution"
	bottom: "lfpn_2_moudle_cpm_4_3"
	top: "lfpn_2_moudle_cpm_4_3_two_channel"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "lfpn_2_moudle_cpm_4_3_two_channel/bn"
	type: "BatchNorm"
	bottom: "lfpn_2_moudle_cpm_4_3_two_channel"
	top: "lfpn_2_moudle_cpm_4_3_two_channel"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "lfpn_2_moudle_cpm_4_3_two_channel/scale"
	type: "Scale"
	bottom: "lfpn_2_moudle_cpm_4_3_two_channel"
	top: "lfpn_2_moudle_cpm_4_3_two_channel"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "lfpn_2_moudle_cpm_4_3_two_channel/relu"
	type: "ReLU"
	bottom: "lfpn_2_moudle_cpm_4_3_two_channel"
	top: "lfpn_2_moudle_cpm_4_3_two_channel"
}

layer{
	name: "lfpn_2_moudle_cpm_4_3_two_channel_2"
	type: "Convolution"
	bottom: "lfpn_2_moudle_cpm_4_3_two_channel"
	top: "lfpn_2_moudle_cpm_4_3_two_channel_2"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "lfpn_2_moudle_cpm_4_3_two_channel_2/bn"
	type: "BatchNorm"
	bottom: "lfpn_2_moudle_cpm_4_3_two_channel_2"
	top: "lfpn_2_moudle_cpm_4_3_two_channel_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "lfpn_2_moudle_cpm_4_3_two_channel_2/scale"
	type: "Scale"
	bottom: "lfpn_2_moudle_cpm_4_3_two_channel_2"
	top: "lfpn_2_moudle_cpm_4_3_two_channel_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "lfpn_2_moudle_cpm_4_3_two_channel_2/relu"
	type: "ReLU"
	bottom: "lfpn_2_moudle_cpm_4_3_two_channel_2"
	top: "lfpn_2_moudle_cpm_4_3_two_channel_2"
}
layer {
	name: "dectction_moudle_two"
	type: "Concat"
	bottom: "lfpn_2_moudle_cpm_4_3_one_channel"
	bottom: "lfpn_2_moudle_cpm_4_3_two_channel_2"
	top: "dectction_moudle_two"
}
#######################################################################
#                             modeule three                           #
#######################################################################
##########################LFPN MOUDLE##################################
layer{
	name: "conv6_2_lfpn"
	type: "Convolution"
	bottom: "conv6_2"
	top: "conv6_2_lfpn"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		kernel_size: 1
		stride: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv6_2_lfpn/bn"
	type: "BatchNorm"
	bottom: "conv6_2_lfpn"
	top: "conv6_2_lfpn"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv6_2_lfpn/scale"
	type: "Scale"
	bottom: "conv6_2_lfpn"
	top: "conv6_2_lfpn"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv6_2_lfpn/relu"
	type: "ReLU"
	bottom: "conv6_2_lfpn"
	top: "conv6_2_lfpn"
}

layer{
	name: "conv6_2_lfpn/dec"
	type: "DeConvolution"
	bottom: "conv6_2_lfpn"
	top: "conv6_2_lfpn/dec"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		kernel_size: 4
		stride: 2
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv6_2_lfpn/dec/bn"
	type: "BatchNorm"
	bottom: "conv6_2_lfpn/dec"
	top: "conv6_2_lfpn/dec"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv6_2_lfpn/dec/scale"
	type: "Scale"
	bottom: "conv6_2_lfpn/dec"
	top: "conv6_2_lfpn/dec"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv6_2_lfpn/dec/relu"
	type: "ReLU"
	bottom: "conv6_2_lfpn/dec"
	top: "conv6_2_lfpn/dec"
}
layer{
	name: "conv5_3_lfpn_conv"
	type: "Convolution"
	bottom: "conv5_3"
	top: "conv5_3_lfpn_conv"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "conv5_3_lfpn_conv/bn"
	type: "BatchNorm"
	bottom: "conv5_3_lfpn_conv"
	top: "conv5_3_lfpn_conv"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "conv5_3_lfpn_conv/scale"
	type: "Scale"
	bottom: "conv5_3_lfpn_conv"
	top: "conv5_3_lfpn_conv"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "conv5_3_lfpn_conv/relu"
	type: "ReLU"
	bottom: "conv5_3_lfpn_conv"
	top: "conv5_3_lfpn_conv"
}
layer{
	name: "lfpn_3/eltwise"
	type: "Eltwise"
	bottom: "conv5_3_lfpn_conv"
	bottom: "conv6_2_lfpn/dec"
	top: "lfpn_3_moudle"
	eltwise_param {
		operation: SUM
	}
}
#################context moudle####################
layer{
	name: "lfpn_3_moudle_cpm_5_3"
	type: "Convolution"
	bottom: "lfpn_3_moudle"
	top: "lfpn_3_moudle_cpm_5_3"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "lfpn_3_moudle_cpm_5_3/bn"
	type: "BatchNorm"
	bottom: "lfpn_3_moudle_cpm_5_3"
	top: "lfpn_3_moudle_cpm_5_3"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "lfpn_3_moudle_cpm_5_3/scale"
	type: "Scale"
	bottom: "lfpn_3_moudle_cpm_5_3"
	top: "lfpn_3_moudle_cpm_5_3"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "lfpn_3_moudle_cpm_5_3/relu"
	type: "ReLU"
	bottom: "lfpn_3_moudle_cpm_5_3"
	top: "lfpn_3_moudle_cpm_5_3"
}
layer{
	name: "lfpn_3_moudle_cpm_5_3_one_channel"
	type: "Convolution"
	bottom: "lfpn_3_moudle_cpm_5_3"
	top: "lfpn_3_moudle_cpm_5_3_one_channel"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "lfpn_3_moudle_cpm_5_3_one_channel/bn"
	type: "BatchNorm"
	bottom: "lfpn_3_moudle_cpm_5_3_one_channel"
	top: "lfpn_3_moudle_cpm_5_3_one_channel"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "lfpn_3_moudle_cpm_5_3_one_channel/scale"
	type: "Scale"
	bottom: "lfpn_3_moudle_cpm_5_3_one_channel"
	top: "lfpn_3_moudle_cpm_5_3_one_channel"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "lfpn_3_moudle_cpm_5_3_one_channel/relu"
	type: "ReLU"
	bottom: "lfpn_3_moudle_cpm_5_3_one_channel"
	top: "lfpn_3_moudle_cpm_5_3_one_channel"
}
#####
layer{
	name: "lfpn_3_moudle_cpm_5_3_two_channel"
	type: "Convolution"
	bottom: "lfpn_3_moudle_cpm_5_3"
	top: "lfpn_3_moudle_cpm_5_3_two_channel"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "lfpn_3_moudle_cpm_5_3_two_channel/bn"
	type: "BatchNorm"
	bottom: "lfpn_3_moudle_cpm_5_3_two_channel"
	top: "lfpn_3_moudle_cpm_5_3_two_channel"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "lfpn_3_moudle_cpm_5_3_two_channel/scale"
	type: "Scale"
	bottom: "lfpn_3_moudle_cpm_5_3_two_channel"
	top: "lfpn_3_moudle_cpm_5_3_two_channel"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "lfpn_3_moudle_cpm_5_3_two_channel/relu"
	type: "ReLU"
	bottom: "lfpn_3_moudle_cpm_5_3_two_channel"
	top: "lfpn_3_moudle_cpm_5_3_two_channel"
}

layer{
	name: "lfpn_3_moudle_cpm_5_3_two_channel_2"
	type: "Convolution"
	bottom: "lfpn_3_moudle_cpm_5_3_two_channel"
	top: "lfpn_3_moudle_cpm_5_3_two_channel_2"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "lfpn_3_moudle_cpm_5_3_two_channel_2/bn"
	type: "BatchNorm"
	bottom: "lfpn_3_moudle_cpm_5_3_two_channel_2"
	top: "lfpn_3_moudle_cpm_5_3_two_channel_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "lfpn_3_moudle_cpm_5_3_two_channel_2/scale"
	type: "Scale"
	bottom: "lfpn_3_moudle_cpm_5_3_two_channel_2"
	top: "lfpn_3_moudle_cpm_5_3_two_channel_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "lfpn_3_moudle_cpm_5_3_two_channel_2/relu"
	type: "ReLU"
	bottom: "lfpn_3_moudle_cpm_5_3_two_channel_2"
	top: "lfpn_3_moudle_cpm_5_3_two_channel_2"
}
layer {
	name: "dectction_moudle_three"
	type: "Concat"
	bottom: "lfpn_3_moudle_cpm_5_3_one_channel"
	bottom: "lfpn_3_moudle_cpm_5_3_two_channel_2"
	top: "dectction_moudle_three"
}
#######################################################################
#                             modeule four                            #
#######################################################################
#################context moudle####################
layer{
	name: "cpm_moudle_7_2"
	type: "Convolution"
	bottom: "conv7_2"
	top: "cpm_moudle_7_2"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_7_2/bn"
	type: "BatchNorm"
	bottom: "cpm_moudle_7_2"
	top: "cpm_moudle_7_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "cpm_moudle_7_2/scale"
	type: "Scale"
	bottom: "cpm_moudle_7_2"
	top: "cpm_moudle_7_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_7_2/relu"
	type: "ReLU"
	bottom: "cpm_moudle_7_2"
	top: "cpm_moudle_7_2"
}
layer{
	name: "cpm_moudle_7_2_one_channel"
	type: "Convolution"
	bottom: "cpm_moudle_7_2"
	top: "cpm_moudle_7_2_one_channel"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 64
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_7_2_one_channel/bn"
	type: "BatchNorm"
	bottom: "cpm_moudle_7_2_one_channel"
	top: "cpm_moudle_7_2_one_channel"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "cpm_moudle_7_2_one_channel/scale"
	type: "Scale"
	bottom: "cpm_moudle_7_2_one_channel"
	top: "cpm_moudle_7_2_one_channel"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_7_2_one_channel/relu"
	type: "ReLU"
	bottom: "cpm_moudle_7_2_one_channel"
	top: "cpm_moudle_7_2_one_channel"
}
#####
layer{
	name: "cpm_moudle_7_2_two_channel"
	type: "Convolution"
	bottom: "cpm_moudle_7_2"
	top: "cpm_moudle_7_2_two_channel"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 64
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_7_2_two_channel/bn"
	type: "BatchNorm"
	bottom: "cpm_moudle_7_2_two_channel"
	top: "cpm_moudle_7_2_two_channel"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "cpm_moudle_7_2_two_channel/scale"
	type: "Scale"
	bottom: "cpm_moudle_7_2_two_channel"
	top: "cpm_moudle_7_2_two_channel"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_7_2_two_channel/relu"
	type: "ReLU"
	bottom: "cpm_moudle_7_2_two_channel"
	top: "cpm_moudle_7_2_two_channel"
}

layer{
	name: "cpm_moudle_7_2_two_channel_2"
	type: "Convolution"
	bottom: "cpm_moudle_7_2_two_channel"
	top: "cpm_moudle_7_2_two_channel_2"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 64
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_7_2_two_channel_2/bn"
	type: "BatchNorm"
	bottom: "cpm_moudle_7_2_two_channel_2"
	top: "cpm_moudle_7_2_two_channel_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "cpm_moudle_7_2_two_channel_2/scale"
	type: "Scale"
	bottom: "cpm_moudle_7_2_two_channel_2"
	top: "cpm_moudle_7_2_two_channel_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_7_2_two_channel_2/relu"
	type: "ReLU"
	bottom: "cpm_moudle_7_2_two_channel_2"
	top: "cpm_moudle_7_2_two_channel_2"
}
layer {
	name: "dectction_moudle_four"
	type: "Concat"
	bottom: "cpm_moudle_7_2_one_channel"
	bottom: "cpm_moudle_7_2_two_channel_2"
	top: "dectction_moudle_four"
}
#######################################################################
#                             modeule five                            #
#######################################################################
#################context moudle####################
layer{
	name: "cpm_moudle_8_2"
	type: "Convolution"
	bottom: "conv8_2"
	top: "cpm_moudle_8_2"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_8_2/bn"
	type: "BatchNorm"
	bottom: "cpm_moudle_8_2"
	top: "cpm_moudle_8_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "cpm_moudle_8_2/scale"
	type: "Scale"
	bottom: "cpm_moudle_8_2"
	top: "cpm_moudle_8_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_8_2/relu"
	type: "ReLU"
	bottom: "cpm_moudle_8_2"
	top: "cpm_moudle_8_2"
}
layer{
	name: "cpm_moudle_8_2_one_channel"
	type: "Convolution"
	bottom: "cpm_moudle_8_2"
	top: "cpm_moudle_8_2_one_channel"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_8_2_one_channel/bn"
	type: "BatchNorm"
	bottom: "cpm_moudle_8_2_one_channel"
	top: "cpm_moudle_8_2_one_channel"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "cpm_moudle_8_2_one_channel/scale"
	type: "Scale"
	bottom: "cpm_moudle_8_2_one_channel"
	top: "cpm_moudle_8_2_one_channel"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_8_2_one_channel/relu"
	type: "ReLU"
	bottom: "cpm_moudle_8_2_one_channel"
	top: "cpm_moudle_8_2_one_channel"
}
#####
layer{
	name: "cpm_moudle_8_2_two_channel"
	type: "Convolution"
	bottom: "cpm_moudle_8_2"
	top: "cpm_moudle_8_2_two_channel"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_8_2_two_channel/bn"
	type: "BatchNorm"
	bottom: "cpm_moudle_8_2_two_channel"
	top: "cpm_moudle_8_2_two_channel"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "cpm_moudle_8_2_two_channel/scale"
	type: "Scale"
	bottom: "cpm_moudle_8_2_two_channel"
	top: "cpm_moudle_8_2_two_channel"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_8_2_two_channel/relu"
	type: "ReLU"
	bottom: "cpm_moudle_8_2_two_channel"
	top: "cpm_moudle_8_2_two_channel"
}

layer{
	name: "cpm_moudle_8_2_two_channel_2"
	type: "Convolution"
	bottom: "cpm_moudle_8_2_two_channel"
	top: "cpm_moudle_8_2_two_channel_2"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_8_2_two_channel_2/bn"
	type: "BatchNorm"
	bottom: "cpm_moudle_8_2_two_channel_2"
	top: "cpm_moudle_8_2_two_channel_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "cpm_moudle_8_2_two_channel_2/scale"
	type: "Scale"
	bottom: "cpm_moudle_8_2_two_channel_2"
	top: "cpm_moudle_8_2_two_channel_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_8_2_two_channel_2/relu"
	type: "ReLU"
	bottom: "cpm_moudle_8_2_two_channel_2"
	top: "cpm_moudle_8_2_two_channel_2"
}
layer {
	name: "dectction_moudle_five"
	type: "Concat"
	bottom: "cpm_moudle_8_2_one_channel"
	bottom: "cpm_moudle_8_2_two_channel_2"
	top: "dectction_moudle_five"
}
#######################################################################
#                             modeule six                            #
#######################################################################
#################context moudle####################
layer{
	name: "cpm_moudle_6_2"
	type: "Convolution"
	bottom: "conv6_2"
	top: "cpm_moudle_6_2"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_6_2/bn"
	type: "BatchNorm"
	bottom: "cpm_moudle_6_2"
	top: "cpm_moudle_6_2"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "cpm_moudle_6_2/scale"
	type: "Scale"
	bottom: "cpm_moudle_6_2"
	top: "cpm_moudle_6_2"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_6_2/relu"
	type: "ReLU"
	bottom: "cpm_moudle_6_2"
	top: "cpm_moudle_6_2"
}
layer{
	name: "cpm_moudle_6_2_one_channel"
	type: "Convolution"
	bottom: "cpm_moudle_6_2"
	top: "cpm_moudle_6_2_one_channel"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_6_2_one_channel/bn"
	type: "BatchNorm"
	bottom: "cpm_moudle_6_2_one_channel"
	top: "cpm_moudle_6_2_one_channel"
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
	param {
		lr_mult: 0
		decay_mult: 0
	}
}
layer {
	name: "cpm_moudle_6_2_one_channel/scale"
	type: "Scale"
	bottom: "cpm_moudle_6_2_one_channel"
	top: "cpm_moudle_6_2_one_channel"
	param {
		lr_mult: 1.0
		decay_mult: 0.0
	}
	param {
		lr_mult: 2.0
		decay_mult: 0.0
	}
	scale_param {
		filler {
			value: 1
		}
		bias_term: true
		bias_filler {
			value: 0
		}
	}
}
layer {
	name: "cpm_moudle_6_2_one_channel/relu"
	type: "ReLU"
	bottom: "cpm_moudle_6_2_one_channel"
	top: "cpm_moudle_6_2_one_channel"
}
#####
layer{
	name: "cpm_moudle_6_2_two_channel"
	type: "Convolution"
	bottom: "cpm_moudle_6_2"
	top: "cpm_moudle_6_2_two_channel"
	param {
		lr_mult: 1
		decay_mult: 1
	}
	param {
		lr_mult: 2
		decay_mult: 1
	}
	convolution_param {
		num_output: 128
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
