[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=16
width=512
height=512
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.1
burn_in=1000
max_batches = 252000
policy=steps
steps=2000, 15000, 50000, 100000, 200000
scales=.1, .1, .1, .1, .1

[convolutional]
batch_normalize=1
filters=19
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=40
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=10
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=40
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=93
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=6
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=93
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=24
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=93
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=231
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=19
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=231
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=33
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=231
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=20
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=231
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=19
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=231
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=231
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=231
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=231
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=231
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=465
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=51
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=465
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=465
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=465
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=465
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=465
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=465
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=465
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=465
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=789
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=72
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=789
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=51
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=789
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=51
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=789
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=51
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=789
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=51
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=102
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=51
size=1
stride=1
pad=1
activation=leaky

[maxpool]
stride=1
size=5

[route]
layers=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-1,-3,-5,-6

[convolutional]
batch_normalize=1
filters=51
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=102
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=51
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=102
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=282
size=1
stride=1
pad=1
activation=linear

[yolo]
mask = 6,7,8
anchors = 7,10, 8.5,13.5, 11,17, 12,22, 15,24,  17,29.5, 18.5,38, 26,45.5, 33, 65
classes = 89
num = 9
jitter = .3
ignore_thresh = .5
truth_thresh = 1
random = 0 ##1

[route]
layers=-4

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=-1, 61

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=51
size=3
stride=1
pad=1
activation=leaky

[maxpool]
stride=1
size=5

[route]
layers=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-1,-3,-5,-6

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=51
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=51
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=282
activation=linear

[yolo]
mask = 3,4,5
anchors = 7,10, 8.5,13.5, 11,17, 12,22, 15,24,  17,29.5, 18.5,38, 26,45.5, 33, 65
classes=89
num=9
jitter=.3
ignore_thresh = .5
truth_thresh = 1
random=0 ##1

[route]
layers=-4

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=-1, 36

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=25
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=leaky

[maxpool]
stride=1
size=5

[route]
layers=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-1,-3,-5,-6

[convolutional]
batch_normalize=1
filters=25
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=27
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=282
size=1
stride=1
pad=1
activation=linear

[yolo]
mask = 0,1,2
anchors = 7,10, 8.5,13.5, 11,17, 12,22, 15,24,  17,29.5, 18.5,38, 26,45.5, 33, 65
classes=89
num=9
jitter=.3
ignore_thresh = .5
truth_thresh = 1
random=0 ##1

